{"Date_and_Time_Handling":{"name":"Date and Time Handling","input":{"office":"","department":"","bic":"","country":"","currency":"","mop":""},"values":{"1":{"type":"script","name":"Validate the Value Date","key":"users","description":"Perform initial validation on the Value Date. Initially, the Value Date is derived based on the settlement date quoted in the payment. All validations and calculations are performed based on the initial derived value date.","action":"","scope":"cots","status":""},"2":{"type":"script","name":"MOP Limitations and Release Date","key":"users","description":"Verify that the payment can be processed according to the clearing limitations  ","action":"","scope":"cots","status":""},"3":{"type":"script","name":"Value Date Determination Selection","key":"users","description":"Assign different dates to each payment according to different criteria: • Processing Date: When the payment is actually processed in GPP. • Debit Date: The date the debit amount is deducted from the account. • Credit Date: The date the credit amount is credited to the account. • Release Date: The day on which the payment is released from GPP. It cannot be earlier than the Local Office Business date and the Processing date. • Whether GPP needs to consider the Soonest value date attribute in the Currency Preferences profile (number of days between the day the payment is processed and the day the payment is settled in FX payments). ","action":"","scope":"cots","status":""},"4":{"type":"script","name":"Cut-off","key":"users","description":"Determine the time within which the payment can be processed.","action":"","scope":"cots","status":""},"5":{"type":"script","name":"Clearing Cutoff","key":"users","description":"Determine the Cut-off time for clearing house MOP: The time of the day after which the payments to specific Clearing MOPs, such as TGT2, are not allowed to be processed with the current business date.","action":"","scope":"cots","status":""},"6":{"type":"script","name":"Treasury","key":"users","description":"Determine the time of the day after which a specific currency is not accepted for the current business date.","action":"","scope":"cots","status":""},"7":{"type":"script","name":"Processing","key":"users","description":"Determine the time of the day after which payments for the current business date are not processed.","action":"","scope":"cots","status":""},"8":{"type":"script","name":"Missed Cut-off","key":"users","description":"Control which messages can miss cut-off and still be processed today.","action":"","scope":"cots","status":""},"9":{"type":"script","name":"Time Hold","key":"users","description":"Stop payment processing until a specified time of day. ","action":"","scope":"cots","status":""},"10":{"type":"script","name":"Office Time Hold","key":"users","description":"Hold messages until MOP opening time","action":"","scope":"cots","status":""},"11":{"type":"script","name":"Debit/Credit Time Hold","key":"users","description":"Hold messages until a specific time for specific customers","action":"","scope":"cots","status":""},"12":{"type":"script","name":"SLA","key":"users","description":"Define specific payment processing commitments and to provide added value to the payment processing","action":"","scope":"cots","status":""}}}}